'''
파일 저장 명 : 5장_0502_1_신동빈.py

작성일 : 2023년 5월 2일
학과 : 컴퓨터공학부
학번 : 202395019
이름 : 신동빈
문제 : 1뷰터 10까지의 정수 중 사용자가 입력한 숫자의 배수만을 더하여 출력하는 프로그램을 작성하시오.
    while(for)문 과 contiune문을 사용하여 작성하시오.
'''
# 1. 정수를 입력 받는다. (배수 - input_num)
# 2. 수가 1부터 (수 - num)
# 3. 합계가 0
# 4. 수가 10까지 반복하면서 (num)
#   a 수를 1 증가시킨다.
#   1) 만약 수가 입력받은 수의 배수이면
#       ① 합계를 계산한다.
#       b-1 수를 1 증가 시킨다.
# c 수를 1 증가 시킨다.
#   2) 아니라면(배수가 아니면)
#       ① 다시 처음으로 돌아간다. continue
#       b-1 수를 1 증가시킨다.
# e 수를 1 증가시킨다.
# 5. 합계를 출력한다.